Revit 2024 API
TransferredProjectStandardsEventArgs.SourceDocument Property
 Source document.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017.2
Syntax
C#
public Document SourceDocument { get; }
Visual Basic
Public ReadOnly Property SourceDocument As Document
	Get
Visual C++
public:
property Document^ SourceDocument {
	Document^ get ();
}
See Also
TransferredProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace